app/controllers/announcements_controller.rb

  def index
    @announcements = Announcement.all
---
SELECT * FROM "announcements"

  def show
    @announcement = Announcement.find(params[:id])
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 1)

  def create
    @announcement = Announcement.new(params[:announcement])
    if @announcement.save
---
INSERT INTO "announcements" ("name", "updated_at", "description", "course_id", "created_at") VALUES('Welcome to CIS 282', '2009-12-07 02:57:39', 'We''re going to abstract the hell out of everything so none of it works!', 1, '2009-12-07 02:57:39')