app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT * FROM "assignments"

  def show
    @assignment = Assignment.find(params[:id])
---
SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)

  def create
    @assignment = Assignment.new(params[:assignment])
    if @assignment.save
---
INSERT INTO "assignments" ("name", "updated_at", "description", "points_possible", "due_date", "course_id", "created_at") VALUES('Battleship', '2009-12-07 07:49:33', '', 35.0, '2009-12-10', 1, '2009-12-07 07:49:33')