app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def create
    @course = Course.new(params[:course])
    if @course.save
---
INSERT INTO "courses" ("name", "updated_at", "description", "created_at") VALUES('CIS 282', '2009-12-07 02:37:49', 'Introduction to Ruby', '2009-12-07 02:37:49')