app/controllers/roles_controller.rb

SELECT * FROM "roles"
---
  def index
    @roles = Role.all

SELECT * FROM "roles" WHERE ("roles"."id" = 1)
---
  def show
    @role = Role.find(params[:id])

INSERT INTO "roles" ("name", "updated_at", "created_at") VALUES('Admin', '2009-12-06 19:50:51', '2009-12-06 19:50:51')
---
  def create
    @role = Role.new(params[:role])
    if @role.save

SELECT * FROM "roles" WHERE ("roles"."id" = 3)
---
  def edit
    @role = Role.find(params[:id])

SELECT * FROM "roles" WHERE ("roles"."id" = 3)
UPDATE "roles" SET "name" = 'Student', "updated_at" = '2009-12-06 20:00:31' WHERE "id" = 3
---
  def update
    @role = Role.find(params[:id])
    if @role.update_attributes(params[:role])