app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "updated_at", "crypted_password", "username", "password_salt", "persistence_token", "created_at") VALUES('Andrew Canfield', '2009-12-06 19:54:50', '850282769ba32fbdd06230e71c3c2ee2c757e76e56ff12ba1ce471c6684abd42180abb32fb751e10842bf46acb00f7dd7f9bd0177ee92c5d7b6e70be4cfcea68', 'acanfield', 'mdwVA0IBXWuuY15xBv2p', '5c01d6bc23d53419ca00057fedadd26bfa15ed9ac4343a3df5e6116ab72559e7c96e9f3decccf51350b0381a2b2dd3e313425db735b2b10ddad86e14ef67cd45', '2009-12-06 19:54:50')

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "username" = 'djones', "updated_at" = '2009-12-06 20:14:28' WHERE "id" = 2